var commentList = {
    "6": [
        "66번 국도로 떠납니다."
    ],
    "감": [
        "감시기지 : 지브롤터에 진입합니다."
    ],
    "겐": [
        "겐지가 함께한다."
    ],
    "게": [
        "게임을 하면 이겨야지!"
    ],
    "고": [
        "고요를 체험하시오."
    ],
    "거": [
        "거점을 점령하겠다. 순식간에 처리하자.",
        "거세게 밀어붙여라! 이러다 지게 생겼다!"
    ],
    "개": [
        "개인적인 감정은 없어요."
    ],
    "계": [
        "계획대로 움직여라, 문제가 생기면 내가 구해주마."
    ],
    "그": [
        "그대 안에 혼돈이 있소.(부조화의 구슬 시전시)"
    ],
    "궁": [
        "궁극기 충전 중이다.",
        "궁극기가 거의 준비됐다."
    ],
    "눔": [
        "눔바니로 떠납니다."
    ],
    "네": [
        "네팔로 떠납니다."
    ],
    "눈": [
        "눈동자로 들어가시오."
    ],
    "너": [
        "너는 대단한 일을 해낼 거란다.",
        "너에게 나노 강화제를 투여했다. 돌격해서 쓴 맛을 보여줘!"
    ],
    "내": [
        "내새끼!",
        "내이름은 맥크리.",
        "내안의 용이 꿈틀댄다.",
        "내 화살은 표적을 찾아낸다.",
        "내 화살은 빗나가지 않아",
        "내가 널 엄호할게, 파리하."
    ],
    "누": [
        "누가 장의사좀 불러."
    ],
    "도": [
        "도라도로 떠납니다."
    ],
    "동": [
        "동쥬 뿌시숴!(Dòng zhù, bù xǔ zǒu!)"
    ],
    "디": [
        "D.Va 온라인!"
    ],
    "데": [
        "데자뷰, 느껴본 적 있어?"
    ],
    "두": [
        "두↘왑↗!"
    ],
    "리": [
        "리장 타워에 도착합니다."
    ],
    "류": [
        "류-진노 켄오 쿠라에!",
        "류요- 와가 테키오 쿠라에!",
        "류-와 와레니 나루!(용이 내가 된다!)"
    ],
    "라": [
        "라인하르트! 대령했소이다."
    ],
    "로": [
        "로드호그의 시간이다."
    ],
    "루": [
        "루시우가 여러분을 찾아갑니다!"
    ],
    "미": [
        "미오스테테모, 묘-리와스테즈."
    ],
    "목": [
        "목표를 포착했다."
    ],
    "망": [
        "망치 나가신다!"
    ],
    "볼": [
        "볼스카야 인더스트리에 진입합니다."
    ],
    "비": [
        "비트에 몸을 맡겨라!"
    ],
    "방": [
        "방어구 가지러 와!",
        "방어구 집어!",
        "방어구가 아직 저기 있어.",
        "방어구 필요한 사람 없어?"
    ],
    "보": [
        "보이지 않는 것을 봐라."
    ],
    "발": [
        "발할라를 향하여."
    ],
    "불": [
        "불이 붙었소, 하지만 소화기는 필요 없소(젠야타 폭주 시)"
    ],
    "석": [
        "석양이 진다..."
    ],
    "솔": [
        "솔저:76 작전을 시작한다."
    ],
    "신": [
        "신사 숙녀 여러분! 한 번 달려보자고!",
        "신념을 위한 싸움을 멈추지 마라."  
    ],
    "시": [
        "시스템 정상. D.Va! 출격 준비 완료!",
        "시메트라, 보고합니다.",
        "시노 니오이카... 요시, 이츠데모 코이!(죽음의 냄새인가... 좋아, 언제든지 와라!)",
        "시공의 폭풍에 온 것을 환영하네!"
    ],
    "상": [
        "상상력이야 말로 발견의 어머니입니다."
    ],
    "순": [
        "순간이동기 가동. 빠르게 움직여요!",
        "순간이동기 냄새가 나는데."
    ],
    "생": [
        "생체장 전개.",
        "생체장 활성화."
    ],
    "새": [
        "새로운 영웅은 언제나 환영이야.",
        "새로운 영웅은 언제나 환영이야.",
        "새로운 영웅은 언제나 환영이야.",
        "새로운 영웅은 언제나 환영이야.(너만 빼고.)"
    ],
    "육": [
        "66번 국도로 떠납니다,"
    ],
    "아": [
        "아누비스 신전에 진입합니다.",
        "아무도 내게서 숨진 못해",
        "아곤 빠가돈!(Огонь по готовности!)",
        "아나, 준비완료."
    ],
    "엄": [
        "엄살 부리지마." 
    ],
    "왕": [
        "왕의 길에 진입합니다."
    ],
    "일": [
        "일리오스에 도착합니다.",
        "일단 만들어! 그리고 부숴!"
    ],
    "용": [
        "용이 내가 된다!",
        "용이 눈을 뜬다.",
        "용의 눈으로 봐라..",
        "용의 징표를 남겨 주지",
        "용이여, 적들을 삼켜라!"
    ],
    "안": [
        "안녕, 친구들! 해결사가 왔어!"
    ],
    "이": [
        "이것도 너프해보시지!"
    ],
    "윈": [
        "윈스턴 보고합니다!"
    ],
    "오": [
        "오우, 제대로 놀아보자!",
        "오늘 당직은 메르시입니다.",
        "오오카미요, 와가 테키오 쿠라에!",
        "5, 4, 3, 2, 1 공격 개시!",
        "오... 가능성이 어마어마하군."
    ],
    "영": [
        "영웅이여, 일어나세요!",
        "영웅은 죽지 않아요.",
        "영웅은 죽지 않아요... 대가를 치를 뿐."
    ],
    "요": [
        "요시! 적 포탑을 파괴했다."
    ],
    "와": [
        "와가 코코로, 메이쿄-시스이.(나의 마음은 명경지수)",
        "와가 코코로와 류-노 코코로.(나의 마음은 용의 마음)",
        "와아, 우리 팀 좀 봐. 진짜 잘할 거야!"
    ],
    "여": [
        "여길 죽음으로 쓸어주마!"
    ],
    "예": [
        "예! 우리 실력을 보여주자!"
    ],
    "죽": [
        "죽어! 죽어! 죽어!",
        "죽일 시간이다.",
        "죽음을 맞이해라."
    ],
    "전": [
        "전술 조준경 활성화!"
    ],
    "자": [
        "자리야. 임무 대기중."
    ],
    "제": [
        "제가 여러분을 돌보겠어요."
    ],
    "젠": [
        "젠야타가 왔소."
    ],
    "진": [
        "진정한 자아에는 형체가 없는 법."
    ],
    "적": [
        "적포탑을 파괴했다.",
        "적 순간이동기를 파괴했네."
    ],
    "정": [
        "정의는 저절로 실현되지 않아."
    ],
    "저": [
        "저격수다. 눈 똑바로 뜨라고."
    ],
    "초": [
        "초오오↗고오오↗여어어어얼↗ 용↗광↗로오오오오↗!!!"
    ],
    "트": [
        "트레이서 출동!"
    ],
    "토": [
        "토르비욘! 작업준비 끝!"
    ],
    "터": [
        "터트려 버려! 그러니까 저놈들을! 거점 말고!"
    ],
    "파": [
        "파라, 작전 개시!"
    ],
    "피": [
        "피곤해 보이는데?"
    ],
    "포": [
        "포화 개시!",
        "포탑 설치!"
    ],
    "폭": [
        "폭탄 받아라!"
    ],
    "하": [
        "하나무라로 떠납니다.",
        "하늘에서 정의가 빗발친다!"
    ],
    "할": [
        "할리우드에 오신 것을 환영합니다."
    ],
    "한": [
        "한방이면 충분해."
    ],
    "화": [
        "화물을 옮기고 있다.",
        "화물이 멈췄다."
    ],
    "현": [
        "현명하게 행동해라, 함께 헤쳐나가자."
    ],
    "혼": [
        "혼키오 미세테미로.(진짜 실력을 보여봐라)"
    ],
    "헤": [
        "헤헤헤, 너한테 기대가 크구나."
    ],
    "깽": [
        "깽판 치기 딱 좋은 날씨네!"
    ],
    "똑": [
        "똑똑, 메이가 왔어요."
    ],
    "똥": [
        "똥쥬 뿌시숴!(Dòng zhù, bù xǔ zǒu!)"
    ],
    "뚜": [
        "뚜↘왑↗!"
    ],
    "쀼": [
        "쀼↗...쀼↗ 쀼↗쀼↘쀼↗!"
    ],
    "뿌": [
        "뿌↗...쀼↗ 쀼↗쀼↘쀼↗!"
    ],
    "삐": [
        "삐→...유↘우↘우↘웃↓!"
    ],
    "D": [
        "D.Va 온라인!",
        "D.Va를 실제로 보다니... 후하오! 싸인 좀 해 줄래?"
    ]
};
var commentCount = 0;
(function() {
    // 대사 개수를 센다. 확률 조정에 의해 늘어난 것들은 세지 않는다.
    for (var key in commentList)
        commentCount += commentList[key].reduce(function(a, i) {
            if (a.indexOf(i) === -1) a.push(i);
            return a;
        }, []).length;
})();

function makeRandom(min, max) {
    var RandVal = Math.random() * (max-min) + min;
    return Math.floor(RandVal);
}

function mixing(original) {
    for(var i=original.length-1; i >= 0; i--){
        var mix = original.charAt(i);

        if (mix in commentList) {
            var list = commentList[mix];
            var random = makeRandom(0, list.length); // length가 0이면 항상 0
            return original.substr(0, i+1) + "..." + list[random].substr(1);
        }
    }
}
